GopalSaraf/Practicals/PSDL/include/proc/pic18lf46k42.inc
// Register: IPR4
#define IPR4 IPR4
IPR4                                     equ 03984h
// bitfield definitions
IPR4_TMR1IP_POSN                         equ 0000h
IPR4_TMR1IP_POSITION                     equ 0000h
IPR4_TMR1IP_SIZE                         equ 0001h
IPR4_TMR1IP_LENGTH                       equ 0001h
IPR4_TMR1IP_MASK                         equ 0001h
IPR4_TMR1GIP_POSN                        equ 0001h
IPR4_TMR1GIP_POSITION                    equ 0001h
IPR4_TMR1GIP_SIZE                        equ 0001h
IPR4_TMR1GIP_LENGTH                      equ 0001h
IPR4_TMR1GIP_MASK                        equ 0002h
IPR4_TMR2IP_POSN                         equ 0002h
IPR4_TMR2IP_POSITION                     equ 0002h
IPR4_TMR2IP_SIZE                         equ 0001h
IPR4_TMR2IP_LENGTH                       equ 0001h
IPR4_TMR2IP_MASK                         equ 0004h
IPR4_CCP1IP_POSN                         equ 0003h
IPR4_CCP1IP_POSITION                     equ 0003h
IPR4_CCP1IP_SIZE                         equ 0001h
IPR4_CCP1IP_LENGTH                       equ 0001h
IPR4_CCP1IP_MASK                         equ 0008h
IPR4_NCO1IP_POSN                         equ 0005h
IPR4_NCO1IP_POSITION                     equ 0005h
IPR4_NCO1IP_SIZE                         equ 0001h
IPR4_NCO1IP_LENGTH                       equ 0001h
IPR4_NCO1IP_MASK                         equ 0020h
IPR4_CWG1IP_POSN                         equ 0006h
IPR4_CWG1IP_POSITION                     equ 0006h
IPR4_CWG1IP_SIZE                         equ 0001h
IPR4_CWG1IP_LENGTH                       equ 0001h
IPR4_CWG1IP_MASK                         equ 0040h
IPR4_CLC1IP_POSN                         equ 0007h
IPR4_CLC1IP_POSITION                     equ 0007h
IPR4_CLC1IP_SIZE                         equ 0001h
IPR4_CLC1IP_LENGTH                       equ 0001h
IPR4_CLC1IP_MASK                         equ 0080h

// Register: IPR5
#define IPR5 IPR5
IPR5                                     equ 03985h
// bitfield definitions
IPR5_INT1IP_POSN                         equ 0000h
IPR5_INT1IP_POSITION                     equ 0000h
IPR5_INT1IP_SIZE                         equ 0001h
IPR5_INT1IP_LENGTH                       equ 0001h
IPR5_INT1IP_MASK                         equ 0001h
IPR5_C2IP_POSN                           equ 0001h
IPR5_C2IP_POSITION                       equ 0001h
IPR5_C2IP_SIZE                           equ 0001h
IPR5_C2IP_LENGTH                         equ 0001h
IPR5_C2IP_MASK                           equ 0002h
IPR5_DMA2SCNTIP_POSN                     equ 0002h
IPR5_DMA2SCNTIP_POSITION                 equ 0002h
IPR5_DMA2SCNTIP_SIZE                     equ 0001h
IPR5_DMA2SCNTIP_LENGTH                   equ 0001h
IPR5_DMA2SCNTIP_MASK                     equ 0004h
IPR5_DMA2DCNTIP_POSN                     equ 0003h
IPR5_DMA2DCNTIP_POSITION                 equ 0003h
IPR5_DMA2DCNTIP_SIZE                     equ 0001h
IPR5_DMA2DCNTIP_LENGTH                   equ 0001h
IPR5_DMA2DCNTIP_MASK                     equ 0008h
IPR5_DMA2ORIP_POSN                       equ 0004h
IPR5_DMA2ORIP_POSITION                   equ 0004h
IPR5_DMA2ORIP_SIZE                       equ 0001h
IPR5_DMA2ORIP_LENGTH                     equ 0001h
IPR5_DMA2ORIP_MASK                       equ 0010h
IPR5_DMA2AIP_POSN                        equ 0005h
IPR5_DMA2AIP_POSITION                    equ 0005h
IPR5_DMA2AIP_SIZE                        equ 0001h
IPR5_DMA2AIP_LENGTH                      equ 0001h
IPR5_DMA2AIP_MASK                        equ 0020h
IPR5_I2C2RXIP_POSN                       equ 0006h
IPR5_I2C2RXIP_POSITION                   equ 0006h
IPR5_I2C2RXIP_SIZE                       equ 0001h
IPR5_I2C2RXIP_LENGTH                     equ 0001h
IPR5_I2C2RXIP_MASK                       equ 0040h
IPR5_I2C2TXIP_POSN                       equ 0007h
IPR5_I2C2TXIP_POSITION                   equ 0007h
IPR5_I2C2TXIP_SIZE                       equ 0001h
IPR5_I2C2TXIP_LENGTH                     equ 0001h
IPR5_I2C2TXIP_MASK                       equ 0080h

// Register: IPR6
#define IPR6 IPR6
IPR6                                     equ 03986h
// bitfield definitions
IPR6_I2C2IP_POSN                         equ 0000h
IPR6_I2C2IP_POSITION                     equ 0000h
IPR6_I2C2IP_SIZE                         equ 0001h
IPR6_I2C2IP_LENGTH                       equ 0001h
IPR6_I2C2IP_MASK                         equ 0001h
IPR6_I2C2EIP_POSN                        equ 0001h
IPR6_I2C2EIP_POSITION                    equ 0001h
IPR6_I2C2EIP_SIZE                        equ 0001h
IPR6_I2C2EIP_LENGTH                      equ 0001h
IPR6_I2C2EIP_MASK                        equ 0002h
IPR6_U2RXIP_POSN                         equ 0002h
IPR6_U2RXIP_POSITION                     equ 0002h
IPR6_U2RXIP_SIZE                         equ 0001h
IPR6_U2RXIP_LENGTH                       equ 0001h
IPR6_U2RXIP_MASK                         equ 0004h
IPR6_U2TXIP_POSN                         equ 0003h
IPR6_U2TXIP_POSITION                     equ 0003h
IPR6_U2TXIP_SIZE                         equ 0001h
IPR6_U2TXIP_LENGTH                       equ 0001h
IPR6_U2TXIP_MASK                         equ 0008h
IPR6_U2EIP_POSN                          equ 0004h
IPR6_U2EIP_POSITION                      equ 0004h
IPR6_U2EIP_SIZE                          equ 0001h
IPR6_U2EIP_LENGTH                        equ 0001h
IPR6_U2EIP_MASK                          equ 0010h
IPR6_U2IP_POSN                           equ 0005h
IPR6_U2IP_POSITION                       equ 0005h
IPR6_U2IP_SIZE                           equ 0001h
IPR6_U2IP_LENGTH                         equ 0001h
IPR6_U2IP_MASK                           equ 0020h
IPR6_TMR3IP_POSN                         equ 0006h
IPR6_TMR3IP_POSITION                     equ 0006h
IPR6_TMR3IP_SIZE                         equ 0001h
IPR6_TMR3IP_LENGTH                       equ 0001h
IPR6_TMR3IP_MASK                         equ 0040h
IPR6_TMR3GIP_POSN                        equ 0007h
IPR6_TMR3GIP_POSITION                    equ 0007h
IPR6_TMR3GIP_SIZE                        equ 0001h
IPR6_TMR3GIP_LENGTH                      equ 0001h
IPR6_TMR3GIP_MASK                        equ 0080h

// Register: IPR7
#define IPR7 IPR7
IPR7                                     equ 03987h
// bitfield definitions
IPR7_TMR4IP_POSN                         equ 0000h
IPR7_TMR4IP_POSITION                     equ 0000h
IPR7_TMR4IP_SIZE                         equ 0001h
IPR7_TMR4IP_LENGTH                       equ 0001h
IPR7_TMR4IP_MASK                         equ 0001h
IPR7_CCP2IP_POSN                         equ 0001h
IPR7_CCP2IP_POSITION                     equ 0001h
IPR7_CCP2IP_SIZE                         equ 0001h
IPR7_CCP2IP_LENGTH                       equ 0001h
IPR7_CCP2IP_MASK                         equ 0002h
IPR7_CWG2IP_POSN                         equ 0003h
IPR7_CWG2IP_POSITION                     equ 0003h
IPR7_CWG2IP_SIZE                         equ 0001h
IPR7_CWG2IP_LENGTH                       equ 0001h
IPR7_CWG2IP_MASK                         equ 0008h
IPR7_CLC2IP_POSN                         equ 0004h
IPR7_CLC2IP_POSITION                     equ 0004h
IPR7_CLC2IP_SIZE                         equ 0001h
IPR7_CLC2IP_LENGTH                       equ 0001h
IPR7_CLC2IP_MASK                         equ 0010h
IPR7_INT2IP_POSN                         equ 0005h
IPR7_INT2IP_POSITION                     equ 0005h
IPR7_INT2IP_SIZE                         equ 0001h
IPR7_INT2IP_LENGTH                       equ 0001h
IPR7_INT2IP_MASK                         equ 0020h

// Register: IPR8
#define IPR8 IPR8
IPR8                                     equ 03988h
// bitfield definitions
IPR8_TMR5IP_POSN                         equ 0006h
IPR8_TMR5IP_POSITION                     equ 0006h
IPR8_TMR5IP_SIZE                         equ 0001h
IPR8_TMR5IP_LENGTH                       equ 0001h
IPR8_TMR5IP_MASK                         equ 0040h
IPR8_TMR5GIP_POSN                        equ 0007h
IPR8_TMR5GIP_POSITION                    equ 0007h
IPR8_TMR5GIP_SIZE                        equ 0001h
IPR8_TMR5GIP_LENGTH                      equ 0001h
IPR8_TMR5GIP_MASK                        equ 0080h

// Register: IPR9
#define IPR9 IPR9
IPR9                                     equ 03989h
// bitfield definitions
IPR9_TMR6IP_POSN                         equ 0000h
IPR9_TMR6IP_POSITION                     equ 0000h
IPR9_TMR6IP_SIZE                         equ 0001h
IPR9_TMR6IP_LENGTH                       equ 0001h
IPR9_TMR6IP_MASK                         equ 0001h
IPR9_CCP3IP_POSN                         equ 0001h
IPR9_CCP3IP_POSITION                     equ 0001h
IPR9_CCP3IP_SIZE                         equ 0001h
IPR9_CCP3IP_LENGTH                       equ 0001h
IPR9_CCP3IP_MASK                         equ 0002h
IPR9_CWG3IP_POSN                         equ 0002h
IPR9_CWG3IP_POSITION                     equ 0002h
IPR9_CWG3IP_SIZE                         equ 0001h
IPR9_CWG3IP_LENGTH                       equ 0001h
IPR9_CWG3IP_MASK                         equ 0004h
IPR9_CLC3IP_POSN                         equ 0003h
IPR9_CLC3IP_POSITION                     equ 0003h
IPR9_CLC3IP_SIZE                         equ 0001h
IPR9_CLC3IP_LENGTH                       equ 0001h
IPR9_CLC3IP_MASK                         equ 0008h

// Register: IPR10
#define IPR10 IPR10
IPR10                                    equ 0398Ah
// bitfield definitions
IPR10_CCP4IP_POSN                        equ 0000h
IPR10_CCP4IP_POSITION                    equ 0000h
IPR10_CCP4IP_SIZE                        equ 0001h
IPR10_CCP4IP_LENGTH                      equ 0001h
IPR10_CCP4IP_MASK                        equ 0001h
IPR10_CLC4IP_POSN                        equ 0001h
IPR10_CLC4IP_POSITION                    equ 0001h
IPR10_CLC4IP_SIZE                        equ 0001h
IPR10_CLC4IP_LENGTH                      equ 0001h
IPR10_CLC4IP_MASK                        equ 0002h

// Register: PIE0
#define PIE0 PIE0
PIE0                                     equ 03990h
// bitfield definitions
PIE0_SWIE_POSN                           equ 0000h
PIE0_SWIE_POSITION                       equ 0000h
PIE0_SWIE_SIZE                           equ 0001h
PIE0_SWIE_LENGTH                         equ 0001h
PIE0_SWIE_MASK                           equ 0001h
PIE0_HLVDIE_POSN                         equ 0001h
PIE0_HLVDIE_POSITION                     equ 0001h
PIE0_HLVDIE_SIZE                         equ 0001h
PIE0_HLVDIE_LENGTH                       equ 0001h
PIE0_HLVDIE_MASK                         equ 0002h
PIE0_OSFIE_POSN                          equ 0002h
PIE0_OSFIE_POSITION                      equ 0002h
PIE0_OSFIE_SIZE                          equ 0001h
PIE0_OSFIE_LENGTH                        equ 0001h
PIE0_OSFIE_MASK                          equ 0004h
PIE0_CSWIE_POSN                          equ 0003h
PIE0_CSWIE_POSITION                      equ 0003h
PIE0_CSWIE_SIZE                          equ 0001h
PIE0_CSWIE_LENGTH                        equ 0001h
PIE0_CSWIE_MASK                          equ 0008h
PIE0_NVMIE_POSN                          equ 0004h
PIE0_NVMIE_POSITION                      equ 0004h
PIE0_NVMIE_SIZE                          equ 0001h
PIE0_NVMIE_LENGTH                        equ 0001h
PIE0_NVMIE_MASK                          equ 0010h
PIE0_SCANIE_POSN                         equ 0005h
PIE0_SCANIE_POSITION                     equ 0005h
PIE0_SCANIE_SIZE                         equ 0001h
PIE0_SCANIE_LENGTH                       equ 0001h
PIE0_SCANIE_MASK                         equ 0020h
PIE0_CRCIE_POSN                          equ 0006h
PIE0_CRCIE_POSITION                      equ 0006h
PIE0_CRCIE_SIZE                          equ 0001h
PIE0_CRCIE_LENGTH                        equ 0001h
PIE0_CRCIE_MASK                          equ 0040h
PIE0_IOCIE_POSN                          equ 0007h
PIE0_IOCIE_POSITION                      equ 0007h
PIE0_IOCIE_SIZE                          equ 0001h
PIE0_IOCIE_LENGTH                        equ 0001h
PIE0_IOCIE_MASK                          equ 0080h

// Register: PIE1
#define PIE1 PIE1
PIE1                                     equ 03991h
// bitfield definitions
PIE1_INT0IE_POSN                         equ 0000h
PIE1_INT0IE_POSITION                     equ 0000h
PIE1_INT0IE_SIZE                         equ 0001h
PIE1_INT0IE_LENGTH                       equ 0001h
PIE1_INT0IE_MASK                         equ 0001h
PIE1_ZCDIE_POSN                          equ 0001h
PIE1_ZCDIE_POSITION                      equ 0001h
PIE1_ZCDIE_SIZE                          equ 0001h
PIE1_ZCDIE_LENGTH                        equ 0001h
PIE1_ZCDIE_MASK                          equ 0002h
PIE1_ADIE_POSN                           equ 0002h
PIE1_ADIE_POSITION                       equ 0002h
PIE1_ADIE_SIZE                           equ 0001h
PIE1_ADIE_LENGTH                         equ 0001h
PIE1_ADIE_MASK                           equ 0004h
PIE1_ADTIE_POSN                          equ 0003h
PIE1_ADTIE_POSITION                      equ 0003h
PIE1_ADTIE_SIZE                          equ 0001h
PIE1_ADTIE_LENGTH                        equ 0001h
PIE1_ADTIE_MASK                          equ 0008h
PIE1_C1IE_POSN                           equ 0004h
PIE1_C1IE_POSITION                       equ 0004h
PIE1_C1IE_SIZE                           equ 0001h
PIE1_C1IE_LENGTH                         equ 0001h
PIE1_C1IE_MASK                           equ 0010h
PIE1_SMT1IE_POSN                         equ 0005h
PIE1_SMT1IE_POSITION                     equ 0005h
PIE1_SMT1IE_SIZE                         equ 0001h
PIE1_SMT1IE_LENGTH                       equ 0001h
PIE1_SMT1IE_MASK                         equ 0020h
PIE1_SMT1PRAIE_POSN                      equ 0006h
PIE1_SMT1PRAIE_POSITION                  equ 0006h
PIE1_SMT1PRAIE_SIZE                      equ 0001h
PIE1_SMT1PRAIE_LENGTH                    equ 0001h
PIE1_SMT1PRAIE_MASK                      equ 0040h
PIE1_SMT1PWAIE_POSN                      equ 0007h
PIE1_SMT1PWAIE_POSITION                  equ 0007h
PIE1_SMT1PWAIE_SIZE                      equ 0001h
PIE1_SMT1PWAIE_LENGTH                    equ 0001h
PIE1_SMT1PWAIE_MASK                      equ 0080h

// Register: PIE2
#define PIE2 PIE2
PIE2                                     equ 03992h
// bitfield definitions
PIE2_DMA1SCNTIE_POSN                     equ 0000h
PIE2_DMA1SCNTIE_POSITION                 equ 0000h
PIE2_DMA1SCNTIE_SIZE                     equ 0001h
PIE2_DMA1SCNTIE_LENGTH                   equ 0001h
PIE2_DMA1SCNTIE_MASK                     equ 0001h
PIE2_DMA1DCNTIE_POSN                     equ 0001h
PIE2_DMA1DCNTIE_POSITION                 equ 0001h
PIE2_DMA1DCNTIE_SIZE                     equ 0001h
PIE2_DMA1DCNTIE_LENGTH                   equ 0001h
PIE2_DMA1DCNTIE_MASK                     equ 0002h
PIE2_DMA1ORIE_POSN                       equ 0002h
PIE2_DMA1ORIE_POSITION                   equ 0002h
PIE2_DMA1ORIE_SIZE                       equ 0001h
PIE2_DMA1ORIE_LENGTH                     equ 0001h
PIE2_DMA1ORIE_MASK                       equ 0004h
PIE2_DMA1AIE_POSN                        equ 0003h
PIE2_DMA1AIE_POSITION                    equ 0003h
PIE2_DMA1AIE_SIZE                        equ 0001h
PIE2_DMA1AIE_LENGTH                      equ 0001h
PIE2_DMA1AIE_MASK                        equ 0008h
PIE2_SPI1RXIE_POSN                       equ 0004h
PIE2_SPI1RXIE_POSITION                   equ 0004h
PIE2_SPI1RXIE_SIZE                       equ 0001h
PIE2_SPI1RXIE_LENGTH                     equ 0001h
PIE2_SPI1RXIE_MASK                       equ 0010h
PIE2_SPI1TXIE_POSN                       equ 0005h
PIE2_SPI1TXIE_POSITION                   equ 0005h
PIE2_SPI1TXIE_SIZE                       equ 0001h
PIE2_SPI1TXIE_LENGTH                     equ 0001h
PIE2_SPI1TXIE_MASK                       equ 0020h
PIE2_SPI1IE_POSN                         equ 0006h
PIE2_SPI1IE_POSITION                     equ 0006h
PIE2_SPI1IE_SIZE                         equ 0001h
PIE2_SPI1IE_LENGTH                       equ 0001h
PIE2_SPI1IE_MASK                         equ 0040h
PIE2_I2C1RXIE_POSN                       equ 0007h
PIE2_I2C1RXIE_POSITION                   equ 0007h
PIE2_I2C1RXIE_SIZE                       equ 0001h
PIE2_I2C1RXIE_LENGTH                     equ 0001h
PIE2_I2C1RXIE_MASK                       equ 0080h

// Register: PIE3
#define PIE3 PIE3
PIE3                                     equ 03993h
// bitfield definitions
PIE3_I2C1TXIE_POSN                       equ 0000h
PIE3_I2C1TXIE_POSITION                   equ 0000h
PIE3_I2C1TXIE_SIZE                       equ 0001h
PIE3_I2C1TXIE_LENGTH                     equ 0001h
PIE3_I2C1TXIE_MASK                       equ 0001h
PIE3_I2C1IE_POSN                         equ 0001h
PIE3_I2C1IE_POSITION                     equ 0001h
PIE3_I2C1IE_SIZE                         equ 0001h
PIE3_I2C1IE_LENGTH                       equ 0001h
PIE3_I2C1IE_MASK                         equ 0002h
PIE3_I2C1EIE_POSN                        equ 0002h
PIE3_I2C1EIE_POSITION                    equ 0002h
PIE3_I2C1EIE_SIZE                        equ 0001h
PIE3_I2C1EIE_LENGTH                      equ 0001h
PIE3_I2C1EIE_MASK                        equ 0004h
PIE3_U1RXIE_POSN                         equ 0003h
PIE3_U1RXIE_POSITION                     equ 0003h
PIE3_U1RXIE_SIZE                         equ 0001h
PIE3_U1RXIE_LENGTH                       equ 0001h
PIE3_U1RXIE_MASK                         equ 0008h
PIE3_U1TXIE_POSN                         equ 0004h
PIE3_U1TXIE_POSITION                     equ 0004h
PIE3_U1TXIE_SIZE                         equ 0001h
PIE3_U1TXIE_LENGTH                       equ 0001h
PIE3_U1TXIE_MASK                         equ 0010h
PIE3_U1EIE_POSN                          equ 0005h
PIE3_U1EIE_POSITION                      equ 0005h
PIE3_U1EIE_SIZE                          equ 0001h
PIE3_U1EIE_LENGTH                        equ 0001h
PIE3_U1EIE_MASK                          equ 0020h
PIE3_U1IE_POSN                           equ 0006h
PIE3_U1IE_POSITION                       equ 0006h
PIE3_U1IE_SIZE                           equ 0001h
PIE3_U1IE_LENGTH                         equ 0001h
PIE3_U1IE_MASK                           equ 0040h
PIE3_TMR0IE_POSN                         equ 0007h
PIE3_TMR0IE_POSITION                     equ 0007h
PIE3_TMR0IE_SIZE                         equ 0001h
PIE3_TMR0IE_LENGTH                       equ 0001h
PIE3_TMR0IE_MASK                         equ 0080h

