GopalSaraf/Practicals/PSDL/include/proc/pic18lf46k42.inc
// Register: ANSELE
#define ANSELE ANSELE
ANSELE                                   equ 03A80h
// bitfield definitions
ANSELE_ANSELE0_POSN                      equ 0000h
ANSELE_ANSELE0_POSITION                  equ 0000h
ANSELE_ANSELE0_SIZE                      equ 0001h
ANSELE_ANSELE0_LENGTH                    equ 0001h
ANSELE_ANSELE0_MASK                      equ 0001h
ANSELE_ANSELE1_POSN                      equ 0001h
ANSELE_ANSELE1_POSITION                  equ 0001h
ANSELE_ANSELE1_SIZE                      equ 0001h
ANSELE_ANSELE1_LENGTH                    equ 0001h
ANSELE_ANSELE1_MASK                      equ 0002h
ANSELE_ANSELE2_POSN                      equ 0002h
ANSELE_ANSELE2_POSITION                  equ 0002h
ANSELE_ANSELE2_SIZE                      equ 0001h
ANSELE_ANSELE2_LENGTH                    equ 0001h
ANSELE_ANSELE2_MASK                      equ 0004h

// Register: WPUE
#define WPUE WPUE
WPUE                                     equ 03A81h
// bitfield definitions
WPUE_WPUE0_POSN                          equ 0000h
WPUE_WPUE0_POSITION                      equ 0000h
WPUE_WPUE0_SIZE                          equ 0001h
WPUE_WPUE0_LENGTH                        equ 0001h
WPUE_WPUE0_MASK                          equ 0001h
WPUE_WPUE1_POSN                          equ 0001h
WPUE_WPUE1_POSITION                      equ 0001h
WPUE_WPUE1_SIZE                          equ 0001h
WPUE_WPUE1_LENGTH                        equ 0001h
WPUE_WPUE1_MASK                          equ 0002h
WPUE_WPUE2_POSN                          equ 0002h
WPUE_WPUE2_POSITION                      equ 0002h
WPUE_WPUE2_SIZE                          equ 0001h
WPUE_WPUE2_LENGTH                        equ 0001h
WPUE_WPUE2_MASK                          equ 0004h
WPUE_WPUE3_POSN                          equ 0003h
WPUE_WPUE3_POSITION                      equ 0003h
WPUE_WPUE3_SIZE                          equ 0001h
WPUE_WPUE3_LENGTH                        equ 0001h
WPUE_WPUE3_MASK                          equ 0008h

// Register: ODCONE
#define ODCONE ODCONE
ODCONE                                   equ 03A82h
// bitfield definitions
ODCONE_ODCE0_POSN                        equ 0000h
ODCONE_ODCE0_POSITION                    equ 0000h
ODCONE_ODCE0_SIZE                        equ 0001h
ODCONE_ODCE0_LENGTH                      equ 0001h
ODCONE_ODCE0_MASK                        equ 0001h
ODCONE_ODCE1_POSN                        equ 0001h
ODCONE_ODCE1_POSITION                    equ 0001h
ODCONE_ODCE1_SIZE                        equ 0001h
ODCONE_ODCE1_LENGTH                      equ 0001h
ODCONE_ODCE1_MASK                        equ 0002h
ODCONE_ODCE2_POSN                        equ 0002h
ODCONE_ODCE2_POSITION                    equ 0002h
ODCONE_ODCE2_SIZE                        equ 0001h
ODCONE_ODCE2_LENGTH                      equ 0001h
ODCONE_ODCE2_MASK                        equ 0004h

// Register: SLRCONE
#define SLRCONE SLRCONE
SLRCONE                                  equ 03A83h
// bitfield definitions
SLRCONE_SLRE0_POSN                       equ 0000h
SLRCONE_SLRE0_POSITION                   equ 0000h
SLRCONE_SLRE0_SIZE                       equ 0001h
SLRCONE_SLRE0_LENGTH                     equ 0001h
SLRCONE_SLRE0_MASK                       equ 0001h
SLRCONE_SLRE1_POSN                       equ 0001h
SLRCONE_SLRE1_POSITION                   equ 0001h
SLRCONE_SLRE1_SIZE                       equ 0001h
SLRCONE_SLRE1_LENGTH                     equ 0001h
SLRCONE_SLRE1_MASK                       equ 0002h
SLRCONE_SLRE2_POSN                       equ 0002h
SLRCONE_SLRE2_POSITION                   equ 0002h
SLRCONE_SLRE2_SIZE                       equ 0001h
SLRCONE_SLRE2_LENGTH                     equ 0001h
SLRCONE_SLRE2_MASK                       equ 0004h

// Register: INLVLE
#define INLVLE INLVLE
INLVLE                                   equ 03A84h
// bitfield definitions
INLVLE_INLVLE0_POSN                      equ 0000h
INLVLE_INLVLE0_POSITION                  equ 0000h
INLVLE_INLVLE0_SIZE                      equ 0001h
INLVLE_INLVLE0_LENGTH                    equ 0001h
INLVLE_INLVLE0_MASK                      equ 0001h
INLVLE_INLVLE1_POSN                      equ 0001h
INLVLE_INLVLE1_POSITION                  equ 0001h
INLVLE_INLVLE1_SIZE                      equ 0001h
INLVLE_INLVLE1_LENGTH                    equ 0001h
INLVLE_INLVLE1_MASK                      equ 0002h
INLVLE_INLVLE2_POSN                      equ 0002h
INLVLE_INLVLE2_POSITION                  equ 0002h
INLVLE_INLVLE2_SIZE                      equ 0001h
INLVLE_INLVLE2_LENGTH                    equ 0001h
INLVLE_INLVLE2_MASK                      equ 0004h
INLVLE_INLVLE3_POSN                      equ 0003h
INLVLE_INLVLE3_POSITION                  equ 0003h
INLVLE_INLVLE3_SIZE                      equ 0001h
INLVLE_INLVLE3_LENGTH                    equ 0001h
INLVLE_INLVLE3_MASK                      equ 0008h

// Register: IOCEP
#define IOCEP IOCEP
IOCEP                                    equ 03A85h
// bitfield definitions
IOCEP_IOCEP3_POSN                        equ 0003h
IOCEP_IOCEP3_POSITION                    equ 0003h
IOCEP_IOCEP3_SIZE                        equ 0001h
IOCEP_IOCEP3_LENGTH                      equ 0001h
IOCEP_IOCEP3_MASK                        equ 0008h

// Register: IOCEN
#define IOCEN IOCEN
IOCEN                                    equ 03A86h
// bitfield definitions
IOCEN_IOCEN3_POSN                        equ 0003h
IOCEN_IOCEN3_POSITION                    equ 0003h
IOCEN_IOCEN3_SIZE                        equ 0001h
IOCEN_IOCEN3_LENGTH                      equ 0001h
IOCEN_IOCEN3_MASK                        equ 0008h

// Register: IOCEF
#define IOCEF IOCEF
IOCEF                                    equ 03A87h
// bitfield definitions
IOCEF_IOCEF3_POSN                        equ 0003h
IOCEF_IOCEF3_POSITION                    equ 0003h
IOCEF_IOCEF3_SIZE                        equ 0001h
IOCEF_IOCEF3_LENGTH                      equ 0001h
IOCEF_IOCEF3_MASK                        equ 0008h

// Register: CCDPE
#define CCDPE CCDPE
CCDPE                                    equ 03A88h
// bitfield definitions
CCDPE_CCDPE0_POSN                        equ 0000h
CCDPE_CCDPE0_POSITION                    equ 0000h
CCDPE_CCDPE0_SIZE                        equ 0001h
CCDPE_CCDPE0_LENGTH                      equ 0001h
CCDPE_CCDPE0_MASK                        equ 0001h
CCDPE_CCDPE1_POSN                        equ 0001h
CCDPE_CCDPE1_POSITION                    equ 0001h
CCDPE_CCDPE1_SIZE                        equ 0001h
CCDPE_CCDPE1_LENGTH                      equ 0001h
CCDPE_CCDPE1_MASK                        equ 0002h
CCDPE_CCDPE2_POSN                        equ 0002h
CCDPE_CCDPE2_POSITION                    equ 0002h
CCDPE_CCDPE2_SIZE                        equ 0001h
CCDPE_CCDPE2_LENGTH                      equ 0001h
CCDPE_CCDPE2_MASK                        equ 0004h

// Register: CCDNE
#define CCDNE CCDNE
CCDNE                                    equ 03A89h
// bitfield definitions
CCDNE_CCDNE0_POSN                        equ 0000h
CCDNE_CCDNE0_POSITION                    equ 0000h
CCDNE_CCDNE0_SIZE                        equ 0001h
CCDNE_CCDNE0_LENGTH                      equ 0001h
CCDNE_CCDNE0_MASK                        equ 0001h
CCDNE_CCDNE1_POSN                        equ 0001h
CCDNE_CCDNE1_POSITION                    equ 0001h
CCDNE_CCDNE1_SIZE                        equ 0001h
CCDNE_CCDNE1_LENGTH                      equ 0001h
CCDNE_CCDNE1_MASK                        equ 0002h
CCDNE_CCDNE2_POSN                        equ 0002h
CCDNE_CCDNE2_POSITION                    equ 0002h
CCDNE_CCDNE2_SIZE                        equ 0001h
CCDNE_CCDNE2_LENGTH                      equ 0001h
CCDNE_CCDNE2_MASK                        equ 0004h

// Register: CCDCON
#define CCDCON CCDCON
CCDCON                                   equ 03ABEh
// bitfield definitions
CCDCON_DS_POSN                           equ 0000h
CCDCON_DS_POSITION                       equ 0000h
CCDCON_DS_SIZE                           equ 0002h
CCDCON_DS_LENGTH                         equ 0002h
CCDCON_DS_MASK                           equ 0003h
CCDCON_EN_POSN                           equ 0007h
CCDCON_EN_POSITION                       equ 0007h
CCDCON_EN_SIZE                           equ 0001h
CCDCON_EN_LENGTH                         equ 0001h
CCDCON_EN_MASK                           equ 0080h
CCDCON_CCDS_POSN                         equ 0000h
CCDCON_CCDS_POSITION                     equ 0000h
CCDCON_CCDS_SIZE                         equ 0002h
CCDCON_CCDS_LENGTH                       equ 0002h
CCDCON_CCDS_MASK                         equ 0003h
CCDCON_CCDEN_POSN                        equ 0007h
CCDCON_CCDEN_POSITION                    equ 0007h
CCDCON_CCDEN_SIZE                        equ 0001h
CCDCON_CCDEN_LENGTH                      equ 0001h
CCDCON_CCDEN_MASK                        equ 0080h
CCDCON_SEL0_POSN                         equ 0000h
CCDCON_SEL0_POSITION                     equ 0000h
CCDCON_SEL0_SIZE                         equ 0001h
CCDCON_SEL0_LENGTH                       equ 0001h
CCDCON_SEL0_MASK                         equ 0001h
CCDCON_SEL1_POSN                         equ 0001h
CCDCON_SEL1_POSITION                     equ 0001h
CCDCON_SEL1_SIZE                         equ 0001h
CCDCON_SEL1_LENGTH                       equ 0001h
CCDCON_SEL1_MASK                         equ 0002h

// Register: PPSLOCK
#define PPSLOCK PPSLOCK
PPSLOCK                                  equ 03ABFh
// bitfield definitions
PPSLOCK_PPSLOCKED_POSN                   equ 0000h
PPSLOCK_PPSLOCKED_POSITION               equ 0000h
PPSLOCK_PPSLOCKED_SIZE                   equ 0001h
PPSLOCK_PPSLOCKED_LENGTH                 equ 0001h
PPSLOCK_PPSLOCKED_MASK                   equ 0001h

