GopalSaraf/Practicals/PSDL/include/proc/pic18lf46k42.inc
// Register: SMT1PRU
#define SMT1PRU SMT1PRU
SMT1PRU                                  equ 03F1Dh
// bitfield definitions
SMT1PRU_PR_POSN                          equ 0000h
SMT1PRU_PR_POSITION                      equ 0000h
SMT1PRU_PR_SIZE                          equ 0008h
SMT1PRU_PR_LENGTH                        equ 0008h
SMT1PRU_PR_MASK                          equ 00FFh
SMT1PRU_PR16_POSN                        equ 0000h
SMT1PRU_PR16_POSITION                    equ 0000h
SMT1PRU_PR16_SIZE                        equ 0001h
SMT1PRU_PR16_LENGTH                      equ 0001h
SMT1PRU_PR16_MASK                        equ 0001h
SMT1PRU_PR17_POSN                        equ 0001h
SMT1PRU_PR17_POSITION                    equ 0001h
SMT1PRU_PR17_SIZE                        equ 0001h
SMT1PRU_PR17_LENGTH                      equ 0001h
SMT1PRU_PR17_MASK                        equ 0002h
SMT1PRU_PR18_POSN                        equ 0002h
SMT1PRU_PR18_POSITION                    equ 0002h
SMT1PRU_PR18_SIZE                        equ 0001h
SMT1PRU_PR18_LENGTH                      equ 0001h
SMT1PRU_PR18_MASK                        equ 0004h
SMT1PRU_PR19_POSN                        equ 0003h
SMT1PRU_PR19_POSITION                    equ 0003h
SMT1PRU_PR19_SIZE                        equ 0001h
SMT1PRU_PR19_LENGTH                      equ 0001h
SMT1PRU_PR19_MASK                        equ 0008h
SMT1PRU_PR20_POSN                        equ 0004h
SMT1PRU_PR20_POSITION                    equ 0004h
SMT1PRU_PR20_SIZE                        equ 0001h
SMT1PRU_PR20_LENGTH                      equ 0001h
SMT1PRU_PR20_MASK                        equ 0010h
SMT1PRU_PR21_POSN                        equ 0005h
SMT1PRU_PR21_POSITION                    equ 0005h
SMT1PRU_PR21_SIZE                        equ 0001h
SMT1PRU_PR21_LENGTH                      equ 0001h
SMT1PRU_PR21_MASK                        equ 0020h
SMT1PRU_PR22_POSN                        equ 0006h
SMT1PRU_PR22_POSITION                    equ 0006h
SMT1PRU_PR22_SIZE                        equ 0001h
SMT1PRU_PR22_LENGTH                      equ 0001h
SMT1PRU_PR22_MASK                        equ 0040h
SMT1PRU_PR23_POSN                        equ 0007h
SMT1PRU_PR23_POSITION                    equ 0007h
SMT1PRU_PR23_SIZE                        equ 0001h
SMT1PRU_PR23_LENGTH                      equ 0001h
SMT1PRU_PR23_MASK                        equ 0080h
SMT1PRU_SMT1PR_POSN                      equ 0000h
SMT1PRU_SMT1PR_POSITION                  equ 0000h
SMT1PRU_SMT1PR_SIZE                      equ 0008h
SMT1PRU_SMT1PR_LENGTH                    equ 0008h
SMT1PRU_SMT1PR_MASK                      equ 00FFh
SMT1PRU_SMT1PR16_POSN                    equ 0000h
SMT1PRU_SMT1PR16_POSITION                equ 0000h
SMT1PRU_SMT1PR16_SIZE                    equ 0001h
SMT1PRU_SMT1PR16_LENGTH                  equ 0001h
SMT1PRU_SMT1PR16_MASK                    equ 0001h
SMT1PRU_SMT1PR17_POSN                    equ 0001h
SMT1PRU_SMT1PR17_POSITION                equ 0001h
SMT1PRU_SMT1PR17_SIZE                    equ 0001h
SMT1PRU_SMT1PR17_LENGTH                  equ 0001h
SMT1PRU_SMT1PR17_MASK                    equ 0002h
SMT1PRU_SMT1PR18_POSN                    equ 0002h
SMT1PRU_SMT1PR18_POSITION                equ 0002h
SMT1PRU_SMT1PR18_SIZE                    equ 0001h
SMT1PRU_SMT1PR18_LENGTH                  equ 0001h
SMT1PRU_SMT1PR18_MASK                    equ 0004h
SMT1PRU_SMT1PR19_POSN                    equ 0003h
SMT1PRU_SMT1PR19_POSITION                equ 0003h
SMT1PRU_SMT1PR19_SIZE                    equ 0001h
SMT1PRU_SMT1PR19_LENGTH                  equ 0001h
SMT1PRU_SMT1PR19_MASK                    equ 0008h
SMT1PRU_SMT1PR20_POSN                    equ 0004h
SMT1PRU_SMT1PR20_POSITION                equ 0004h
SMT1PRU_SMT1PR20_SIZE                    equ 0001h
SMT1PRU_SMT1PR20_LENGTH                  equ 0001h
SMT1PRU_SMT1PR20_MASK                    equ 0010h
SMT1PRU_SMT1PR21_POSN                    equ 0005h
SMT1PRU_SMT1PR21_POSITION                equ 0005h
SMT1PRU_SMT1PR21_SIZE                    equ 0001h
SMT1PRU_SMT1PR21_LENGTH                  equ 0001h
SMT1PRU_SMT1PR21_MASK                    equ 0020h
SMT1PRU_SMT1PR22_POSN                    equ 0006h
SMT1PRU_SMT1PR22_POSITION                equ 0006h
SMT1PRU_SMT1PR22_SIZE                    equ 0001h
SMT1PRU_SMT1PR22_LENGTH                  equ 0001h
SMT1PRU_SMT1PR22_MASK                    equ 0040h
SMT1PRU_SMT1PR23_POSN                    equ 0007h
SMT1PRU_SMT1PR23_POSITION                equ 0007h
SMT1PRU_SMT1PR23_SIZE                    equ 0001h
SMT1PRU_SMT1PR23_LENGTH                  equ 0001h
SMT1PRU_SMT1PR23_MASK                    equ 0080h

// Register: SMT1CON0
#define SMT1CON0 SMT1CON0
SMT1CON0                                 equ 03F1Eh
// bitfield definitions
SMT1CON0_PS_POSN                         equ 0000h
SMT1CON0_PS_POSITION                     equ 0000h
SMT1CON0_PS_SIZE                         equ 0002h
SMT1CON0_PS_LENGTH                       equ 0002h
SMT1CON0_PS_MASK                         equ 0003h
SMT1CON0_CPOL_POSN                       equ 0002h
SMT1CON0_CPOL_POSITION                   equ 0002h
SMT1CON0_CPOL_SIZE                       equ 0001h
SMT1CON0_CPOL_LENGTH                     equ 0001h
SMT1CON0_CPOL_MASK                       equ 0004h
SMT1CON0_SPOL_POSN                       equ 0003h
SMT1CON0_SPOL_POSITION                   equ 0003h
SMT1CON0_SPOL_SIZE                       equ 0001h
SMT1CON0_SPOL_LENGTH                     equ 0001h
SMT1CON0_SPOL_MASK                       equ 0008h
SMT1CON0_WPOL_POSN                       equ 0004h
SMT1CON0_WPOL_POSITION                   equ 0004h
SMT1CON0_WPOL_SIZE                       equ 0001h
SMT1CON0_WPOL_LENGTH                     equ 0001h
SMT1CON0_WPOL_MASK                       equ 0010h
SMT1CON0_STP_POSN                        equ 0005h
SMT1CON0_STP_POSITION                    equ 0005h
SMT1CON0_STP_SIZE                        equ 0001h
SMT1CON0_STP_LENGTH                      equ 0001h
SMT1CON0_STP_MASK                        equ 0020h
SMT1CON0_EN_POSN                         equ 0007h
SMT1CON0_EN_POSITION                     equ 0007h
SMT1CON0_EN_SIZE                         equ 0001h
SMT1CON0_EN_LENGTH                       equ 0001h
SMT1CON0_EN_MASK                         equ 0080h
SMT1CON0_SMT1PS_POSN                     equ 0000h
SMT1CON0_SMT1PS_POSITION                 equ 0000h
SMT1CON0_SMT1PS_SIZE                     equ 0002h
SMT1CON0_SMT1PS_LENGTH                   equ 0002h
SMT1CON0_SMT1PS_MASK                     equ 0003h
SMT1CON0_SMT1CPOL_POSN                   equ 0002h
SMT1CON0_SMT1CPOL_POSITION               equ 0002h
SMT1CON0_SMT1CPOL_SIZE                   equ 0001h
SMT1CON0_SMT1CPOL_LENGTH                 equ 0001h
SMT1CON0_SMT1CPOL_MASK                   equ 0004h
SMT1CON0_SMT1SPOL_POSN                   equ 0003h
SMT1CON0_SMT1SPOL_POSITION               equ 0003h
SMT1CON0_SMT1SPOL_SIZE                   equ 0001h
SMT1CON0_SMT1SPOL_LENGTH                 equ 0001h
SMT1CON0_SMT1SPOL_MASK                   equ 0008h
SMT1CON0_SMT1WOL_POSN                    equ 0004h
SMT1CON0_SMT1WOL_POSITION                equ 0004h
SMT1CON0_SMT1WOL_SIZE                    equ 0001h
SMT1CON0_SMT1WOL_LENGTH                  equ 0001h
SMT1CON0_SMT1WOL_MASK                    equ 0010h
SMT1CON0_SMT1STP_POSN                    equ 0005h
SMT1CON0_SMT1STP_POSITION                equ 0005h
SMT1CON0_SMT1STP_SIZE                    equ 0001h
SMT1CON0_SMT1STP_LENGTH                  equ 0001h
SMT1CON0_SMT1STP_MASK                    equ 0020h
SMT1CON0_SMT1EN_POSN                     equ 0007h
SMT1CON0_SMT1EN_POSITION                 equ 0007h
SMT1CON0_SMT1EN_SIZE                     equ 0001h
SMT1CON0_SMT1EN_LENGTH                   equ 0001h
SMT1CON0_SMT1EN_MASK                     equ 0080h
SMT1CON0_PS0_POSN                        equ 0000h
SMT1CON0_PS0_POSITION                    equ 0000h
SMT1CON0_PS0_SIZE                        equ 0001h
SMT1CON0_PS0_LENGTH                      equ 0001h
SMT1CON0_PS0_MASK                        equ 0001h
SMT1CON0_PS1_POSN                        equ 0001h
SMT1CON0_PS1_POSITION                    equ 0001h
SMT1CON0_PS1_SIZE                        equ 0001h
SMT1CON0_PS1_LENGTH                      equ 0001h
SMT1CON0_PS1_MASK                        equ 0002h
SMT1CON0_SMT1PS0_POSN                    equ 0000h
SMT1CON0_SMT1PS0_POSITION                equ 0000h
SMT1CON0_SMT1PS0_SIZE                    equ 0001h
SMT1CON0_SMT1PS0_LENGTH                  equ 0001h
SMT1CON0_SMT1PS0_MASK                    equ 0001h
SMT1CON0_SMT1PS1_POSN                    equ 0001h
SMT1CON0_SMT1PS1_POSITION                equ 0001h
SMT1CON0_SMT1PS1_SIZE                    equ 0001h
SMT1CON0_SMT1PS1_LENGTH                  equ 0001h
SMT1CON0_SMT1PS1_MASK                    equ 0002h

