GopalSaraf/Practicals/PSDL/include/proc/pic18lf46k42.inc
// Register: PORTD
#define PORTD PORTD
PORTD                                    equ 03FCDh
// bitfield definitions
PORTD_RD0_POSN                           equ 0000h
PORTD_RD0_POSITION                       equ 0000h
PORTD_RD0_SIZE                           equ 0001h
PORTD_RD0_LENGTH                         equ 0001h
PORTD_RD0_MASK                           equ 0001h
PORTD_RD1_POSN                           equ 0001h
PORTD_RD1_POSITION                       equ 0001h
PORTD_RD1_SIZE                           equ 0001h
PORTD_RD1_LENGTH                         equ 0001h
PORTD_RD1_MASK                           equ 0002h
PORTD_RD2_POSN                           equ 0002h
PORTD_RD2_POSITION                       equ 0002h
PORTD_RD2_SIZE                           equ 0001h
PORTD_RD2_LENGTH                         equ 0001h
PORTD_RD2_MASK                           equ 0004h
PORTD_RD3_POSN                           equ 0003h
PORTD_RD3_POSITION                       equ 0003h
PORTD_RD3_SIZE                           equ 0001h
PORTD_RD3_LENGTH                         equ 0001h
PORTD_RD3_MASK                           equ 0008h
PORTD_RD4_POSN                           equ 0004h
PORTD_RD4_POSITION                       equ 0004h
PORTD_RD4_SIZE                           equ 0001h
PORTD_RD4_LENGTH                         equ 0001h
PORTD_RD4_MASK                           equ 0010h
PORTD_RD5_POSN                           equ 0005h
PORTD_RD5_POSITION                       equ 0005h
PORTD_RD5_SIZE                           equ 0001h
PORTD_RD5_LENGTH                         equ 0001h
PORTD_RD5_MASK                           equ 0020h
PORTD_RD6_POSN                           equ 0006h
PORTD_RD6_POSITION                       equ 0006h
PORTD_RD6_SIZE                           equ 0001h
PORTD_RD6_LENGTH                         equ 0001h
PORTD_RD6_MASK                           equ 0040h
PORTD_RD7_POSN                           equ 0007h
PORTD_RD7_POSITION                       equ 0007h
PORTD_RD7_SIZE                           equ 0001h
PORTD_RD7_LENGTH                         equ 0001h
PORTD_RD7_MASK                           equ 0080h

// Register: PORTE
#define PORTE PORTE
PORTE                                    equ 03FCEh
// bitfield definitions
PORTE_RE0_POSN                           equ 0000h
PORTE_RE0_POSITION                       equ 0000h
PORTE_RE0_SIZE                           equ 0001h
PORTE_RE0_LENGTH                         equ 0001h
PORTE_RE0_MASK                           equ 0001h
PORTE_RE1_POSN                           equ 0001h
PORTE_RE1_POSITION                       equ 0001h
PORTE_RE1_SIZE                           equ 0001h
PORTE_RE1_LENGTH                         equ 0001h
PORTE_RE1_MASK                           equ 0002h
PORTE_RE2_POSN                           equ 0002h
PORTE_RE2_POSITION                       equ 0002h
PORTE_RE2_SIZE                           equ 0001h
PORTE_RE2_LENGTH                         equ 0001h
PORTE_RE2_MASK                           equ 0004h
PORTE_RE3_POSN                           equ 0003h
PORTE_RE3_POSITION                       equ 0003h
PORTE_RE3_SIZE                           equ 0001h
PORTE_RE3_LENGTH                         equ 0001h
PORTE_RE3_MASK                           equ 0008h

// Register: INTCON0
#define INTCON0 INTCON0
INTCON0                                  equ 03FD2h
// bitfield definitions
INTCON0_INT0EDG_POSN                     equ 0000h
INTCON0_INT0EDG_POSITION                 equ 0000h
INTCON0_INT0EDG_SIZE                     equ 0001h
INTCON0_INT0EDG_LENGTH                   equ 0001h
INTCON0_INT0EDG_MASK                     equ 0001h
INTCON0_INT1EDG_POSN                     equ 0001h
INTCON0_INT1EDG_POSITION                 equ 0001h
INTCON0_INT1EDG_SIZE                     equ 0001h
INTCON0_INT1EDG_LENGTH                   equ 0001h
INTCON0_INT1EDG_MASK                     equ 0002h
INTCON0_INT2EDG_POSN                     equ 0002h
INTCON0_INT2EDG_POSITION                 equ 0002h
INTCON0_INT2EDG_SIZE                     equ 0001h
INTCON0_INT2EDG_LENGTH                   equ 0001h
INTCON0_INT2EDG_MASK                     equ 0004h
INTCON0_IPEN_POSN                        equ 0005h
INTCON0_IPEN_POSITION                    equ 0005h
INTCON0_IPEN_SIZE                        equ 0001h
INTCON0_IPEN_LENGTH                      equ 0001h
INTCON0_IPEN_MASK                        equ 0020h
INTCON0_GIEL_POSN                        equ 0006h
INTCON0_GIEL_POSITION                    equ 0006h
INTCON0_GIEL_SIZE                        equ 0001h
INTCON0_GIEL_LENGTH                      equ 0001h
INTCON0_GIEL_MASK                        equ 0040h
INTCON0_GIE_POSN                         equ 0007h
INTCON0_GIE_POSITION                     equ 0007h
INTCON0_GIE_SIZE                         equ 0001h
INTCON0_GIE_LENGTH                       equ 0001h
INTCON0_GIE_MASK                         equ 0080h
INTCON0_GIEH_POSN                        equ 0007h
INTCON0_GIEH_POSITION                    equ 0007h
INTCON0_GIEH_SIZE                        equ 0001h
INTCON0_GIEH_LENGTH                      equ 0001h
INTCON0_GIEH_MASK                        equ 0080h

// Register: INTCON1
#define INTCON1 INTCON1
INTCON1                                  equ 03FD3h
// bitfield definitions
INTCON1_STAT_POSN                        equ 0006h
INTCON1_STAT_POSITION                    equ 0006h
INTCON1_STAT_SIZE                        equ 0002h
INTCON1_STAT_LENGTH                      equ 0002h
INTCON1_STAT_MASK                        equ 00C0h
INTCON1_STAT0_POSN                       equ 0006h
INTCON1_STAT0_POSITION                   equ 0006h
INTCON1_STAT0_SIZE                       equ 0001h
INTCON1_STAT0_LENGTH                     equ 0001h
INTCON1_STAT0_MASK                       equ 0040h
INTCON1_STAT1_POSN                       equ 0007h
INTCON1_STAT1_POSITION                   equ 0007h
INTCON1_STAT1_SIZE                       equ 0001h
INTCON1_STAT1_LENGTH                     equ 0001h
INTCON1_STAT1_MASK                       equ 0080h

// Register: IVTLOCK
#define IVTLOCK IVTLOCK
IVTLOCK                                  equ 03FD4h
// bitfield definitions
IVTLOCK_IVTLOCKED_POSN                   equ 0000h
IVTLOCK_IVTLOCKED_POSITION               equ 0000h
IVTLOCK_IVTLOCKED_SIZE                   equ 0001h
IVTLOCK_IVTLOCKED_LENGTH                 equ 0001h
IVTLOCK_IVTLOCKED_MASK                   equ 0001h

