GopalSaraf/Practicals/PSDL/include/proc/pic18lf46k42.inc
// Register: IVTBASE
#define IVTBASE IVTBASE
IVTBASE                                  equ 03FD5h

// Register: IVTBASEL
#define IVTBASEL IVTBASEL
IVTBASEL                                 equ 03FD5h
// bitfield definitions
IVTBASEL_BASE0_POSN                      equ 0000h
IVTBASEL_BASE0_POSITION                  equ 0000h
IVTBASEL_BASE0_SIZE                      equ 0001h
IVTBASEL_BASE0_LENGTH                    equ 0001h
IVTBASEL_BASE0_MASK                      equ 0001h
IVTBASEL_BASE1_POSN                      equ 0001h
IVTBASEL_BASE1_POSITION                  equ 0001h
IVTBASEL_BASE1_SIZE                      equ 0001h
IVTBASEL_BASE1_LENGTH                    equ 0001h
IVTBASEL_BASE1_MASK                      equ 0002h
IVTBASEL_BASE2_POSN                      equ 0002h
IVTBASEL_BASE2_POSITION                  equ 0002h
IVTBASEL_BASE2_SIZE                      equ 0001h
IVTBASEL_BASE2_LENGTH                    equ 0001h
IVTBASEL_BASE2_MASK                      equ 0004h
IVTBASEL_BASE3_POSN                      equ 0003h
IVTBASEL_BASE3_POSITION                  equ 0003h
IVTBASEL_BASE3_SIZE                      equ 0001h
IVTBASEL_BASE3_LENGTH                    equ 0001h
IVTBASEL_BASE3_MASK                      equ 0008h
IVTBASEL_BASE4_POSN                      equ 0004h
IVTBASEL_BASE4_POSITION                  equ 0004h
IVTBASEL_BASE4_SIZE                      equ 0001h
IVTBASEL_BASE4_LENGTH                    equ 0001h
IVTBASEL_BASE4_MASK                      equ 0010h
IVTBASEL_BASE5_POSN                      equ 0005h
IVTBASEL_BASE5_POSITION                  equ 0005h
IVTBASEL_BASE5_SIZE                      equ 0001h
IVTBASEL_BASE5_LENGTH                    equ 0001h
IVTBASEL_BASE5_MASK                      equ 0020h
IVTBASEL_BASE6_POSN                      equ 0006h
IVTBASEL_BASE6_POSITION                  equ 0006h
IVTBASEL_BASE6_SIZE                      equ 0001h
IVTBASEL_BASE6_LENGTH                    equ 0001h
IVTBASEL_BASE6_MASK                      equ 0040h
IVTBASEL_BASE7_POSN                      equ 0007h
IVTBASEL_BASE7_POSITION                  equ 0007h
IVTBASEL_BASE7_SIZE                      equ 0001h
IVTBASEL_BASE7_LENGTH                    equ 0001h
IVTBASEL_BASE7_MASK                      equ 0080h

// Register: IVTBASEH
#define IVTBASEH IVTBASEH
IVTBASEH                                 equ 03FD6h
// bitfield definitions
IVTBASEH_BASE8_POSN                      equ 0000h
IVTBASEH_BASE8_POSITION                  equ 0000h
IVTBASEH_BASE8_SIZE                      equ 0001h
IVTBASEH_BASE8_LENGTH                    equ 0001h
IVTBASEH_BASE8_MASK                      equ 0001h
IVTBASEH_BASE9_POSN                      equ 0001h
IVTBASEH_BASE9_POSITION                  equ 0001h
IVTBASEH_BASE9_SIZE                      equ 0001h
IVTBASEH_BASE9_LENGTH                    equ 0001h
IVTBASEH_BASE9_MASK                      equ 0002h
IVTBASEH_BASE10_POSN                     equ 0002h
IVTBASEH_BASE10_POSITION                 equ 0002h
IVTBASEH_BASE10_SIZE                     equ 0001h
IVTBASEH_BASE10_LENGTH                   equ 0001h
IVTBASEH_BASE10_MASK                     equ 0004h
IVTBASEH_BASE11_POSN                     equ 0003h
IVTBASEH_BASE11_POSITION                 equ 0003h
IVTBASEH_BASE11_SIZE                     equ 0001h
IVTBASEH_BASE11_LENGTH                   equ 0001h
IVTBASEH_BASE11_MASK                     equ 0008h
IVTBASEH_BASE12_POSN                     equ 0004h
IVTBASEH_BASE12_POSITION                 equ 0004h
IVTBASEH_BASE12_SIZE                     equ 0001h
IVTBASEH_BASE12_LENGTH                   equ 0001h
IVTBASEH_BASE12_MASK                     equ 0010h
IVTBASEH_BASE13_POSN                     equ 0005h
IVTBASEH_BASE13_POSITION                 equ 0005h
IVTBASEH_BASE13_SIZE                     equ 0001h
IVTBASEH_BASE13_LENGTH                   equ 0001h
IVTBASEH_BASE13_MASK                     equ 0020h
IVTBASEH_BASE14_POSN                     equ 0006h
IVTBASEH_BASE14_POSITION                 equ 0006h
IVTBASEH_BASE14_SIZE                     equ 0001h
IVTBASEH_BASE14_LENGTH                   equ 0001h
IVTBASEH_BASE14_MASK                     equ 0040h
IVTBASEH_BASE15_POSN                     equ 0007h
IVTBASEH_BASE15_POSITION                 equ 0007h
IVTBASEH_BASE15_SIZE                     equ 0001h
IVTBASEH_BASE15_LENGTH                   equ 0001h
IVTBASEH_BASE15_MASK                     equ 0080h

// Register: IVTBASEU
#define IVTBASEU IVTBASEU
IVTBASEU                                 equ 03FD7h
// bitfield definitions
IVTBASEU_BASE16_POSN                     equ 0000h
IVTBASEU_BASE16_POSITION                 equ 0000h
IVTBASEU_BASE16_SIZE                     equ 0001h
IVTBASEU_BASE16_LENGTH                   equ 0001h
IVTBASEU_BASE16_MASK                     equ 0001h
IVTBASEU_BASE17_POSN                     equ 0001h
IVTBASEU_BASE17_POSITION                 equ 0001h
IVTBASEU_BASE17_SIZE                     equ 0001h
IVTBASEU_BASE17_LENGTH                   equ 0001h
IVTBASEU_BASE17_MASK                     equ 0002h
IVTBASEU_BASE18_POSN                     equ 0002h
IVTBASEU_BASE18_POSITION                 equ 0002h
IVTBASEU_BASE18_SIZE                     equ 0001h
IVTBASEU_BASE18_LENGTH                   equ 0001h
IVTBASEU_BASE18_MASK                     equ 0004h
IVTBASEU_BASE19_POSN                     equ 0003h
IVTBASEU_BASE19_POSITION                 equ 0003h
IVTBASEU_BASE19_SIZE                     equ 0001h
IVTBASEU_BASE19_LENGTH                   equ 0001h
IVTBASEU_BASE19_MASK                     equ 0008h
IVTBASEU_BASE20_POSN                     equ 0004h
IVTBASEU_BASE20_POSITION                 equ 0004h
IVTBASEU_BASE20_SIZE                     equ 0001h
IVTBASEU_BASE20_LENGTH                   equ 0001h
IVTBASEU_BASE20_MASK                     equ 0010h

// Register: STATUS
#define STATUS STATUS
STATUS                                   equ 03FD8h
// bitfield definitions
STATUS_NOT_PD_POSN                       equ 0005h
STATUS_NOT_PD_POSITION                   equ 0005h
STATUS_NOT_PD_SIZE                       equ 0001h
STATUS_NOT_PD_LENGTH                     equ 0001h
STATUS_NOT_PD_MASK                       equ 0020h
STATUS_NOT_TO_POSN                       equ 0006h
STATUS_NOT_TO_POSITION                   equ 0006h
STATUS_NOT_TO_SIZE                       equ 0001h
STATUS_NOT_TO_LENGTH                     equ 0001h
STATUS_NOT_TO_MASK                       equ 0040h
STATUS_C_POSN                            equ 0000h
STATUS_C_POSITION                        equ 0000h
STATUS_C_SIZE                            equ 0001h
STATUS_C_LENGTH                          equ 0001h
STATUS_C_MASK                            equ 0001h
STATUS_DC_POSN                           equ 0001h
STATUS_DC_POSITION                       equ 0001h
STATUS_DC_SIZE                           equ 0001h
STATUS_DC_LENGTH                         equ 0001h
STATUS_DC_MASK                           equ 0002h
STATUS_Z_POSN                            equ 0002h
STATUS_Z_POSITION                        equ 0002h
STATUS_Z_SIZE                            equ 0001h
STATUS_Z_LENGTH                          equ 0001h
STATUS_Z_MASK                            equ 0004h
STATUS_OV_POSN                           equ 0003h
STATUS_OV_POSITION                       equ 0003h
STATUS_OV_SIZE                           equ 0001h
STATUS_OV_LENGTH                         equ 0001h
STATUS_OV_MASK                           equ 0008h
STATUS_N_POSN                            equ 0004h
STATUS_N_POSITION                        equ 0004h
STATUS_N_SIZE                            equ 0001h
STATUS_N_LENGTH                          equ 0001h
STATUS_N_MASK                            equ 0010h
STATUS_nPD_POSN                          equ 0005h
STATUS_nPD_POSITION                      equ 0005h
STATUS_nPD_SIZE                          equ 0001h
STATUS_nPD_LENGTH                        equ 0001h
STATUS_nPD_MASK                          equ 0020h
STATUS_nTO_POSN                          equ 0006h
STATUS_nTO_POSITION                      equ 0006h
STATUS_nTO_SIZE                          equ 0001h
STATUS_nTO_LENGTH                        equ 0001h
STATUS_nTO_MASK                          equ 0040h
STATUS_PD_POSN                           equ 0005h
STATUS_PD_POSITION                       equ 0005h
STATUS_PD_SIZE                           equ 0001h
STATUS_PD_LENGTH                         equ 0001h
STATUS_PD_MASK                           equ 0020h
STATUS_TO_POSN                           equ 0006h
STATUS_TO_POSITION                       equ 0006h
STATUS_TO_SIZE                           equ 0001h
STATUS_TO_LENGTH                         equ 0001h
STATUS_TO_MASK                           equ 0040h
STATUS_CARRY_POSN                        equ 0000h
STATUS_CARRY_POSITION                    equ 0000h
STATUS_CARRY_SIZE                        equ 0001h
STATUS_CARRY_LENGTH                      equ 0001h
STATUS_CARRY_MASK                        equ 0001h
STATUS_ZERO_POSN                         equ 0002h
STATUS_ZERO_POSITION                     equ 0002h
STATUS_ZERO_SIZE                         equ 0001h
STATUS_ZERO_LENGTH                       equ 0001h
STATUS_ZERO_MASK                         equ 0004h
STATUS_OVERFLOW_POSN                     equ 0003h
STATUS_OVERFLOW_POSITION                 equ 0003h
STATUS_OVERFLOW_SIZE                     equ 0001h
STATUS_OVERFLOW_LENGTH                   equ 0001h
STATUS_OVERFLOW_MASK                     equ 0008h
STATUS_NEGATIVE_POSN                     equ 0004h
STATUS_NEGATIVE_POSITION                 equ 0004h
STATUS_NEGATIVE_SIZE                     equ 0001h
STATUS_NEGATIVE_LENGTH                   equ 0001h
STATUS_NEGATIVE_MASK                     equ 0010h

// Register: FSR2
#define FSR2 FSR2
FSR2                                     equ 03FD9h

// Register: FSR2L
#define FSR2L FSR2L
FSR2L                                    equ 03FD9h
// bitfield definitions
FSR2L_FSR2L_POSN                         equ 0000h
FSR2L_FSR2L_POSITION                     equ 0000h
FSR2L_FSR2L_SIZE                         equ 0008h
FSR2L_FSR2L_LENGTH                       equ 0008h
FSR2L_FSR2L_MASK                         equ 00FFh

// Register: FSR2H
#define FSR2H FSR2H
FSR2H                                    equ 03FDAh
// bitfield definitions
FSR2H_FSR2H_POSN                         equ 0000h
FSR2H_FSR2H_POSITION                     equ 0000h
FSR2H_FSR2H_SIZE                         equ 0006h
FSR2H_FSR2H_LENGTH                       equ 0006h
FSR2H_FSR2H_MASK                         equ 003Fh

// Register: PLUSW2
#define PLUSW2 PLUSW2
PLUSW2                                   equ 03FDBh
// bitfield definitions
PLUSW2_PLUSW2_POSN                       equ 0000h
PLUSW2_PLUSW2_POSITION                   equ 0000h
PLUSW2_PLUSW2_SIZE                       equ 0008h
PLUSW2_PLUSW2_LENGTH                     equ 0008h
PLUSW2_PLUSW2_MASK                       equ 00FFh

// Register: PREINC2
#define PREINC2 PREINC2
PREINC2                                  equ 03FDCh
// bitfield definitions
PREINC2_PREINC2_POSN                     equ 0000h
PREINC2_PREINC2_POSITION                 equ 0000h
PREINC2_PREINC2_SIZE                     equ 0008h
PREINC2_PREINC2_LENGTH                   equ 0008h
PREINC2_PREINC2_MASK                     equ 00FFh

// Register: POSTDEC2
#define POSTDEC2 POSTDEC2
POSTDEC2                                 equ 03FDDh
// bitfield definitions
POSTDEC2_POSTDEC2_POSN                   equ 0000h
POSTDEC2_POSTDEC2_POSITION               equ 0000h
POSTDEC2_POSTDEC2_SIZE                   equ 0008h
POSTDEC2_POSTDEC2_LENGTH                 equ 0008h
POSTDEC2_POSTDEC2_MASK                   equ 00FFh

// Register: POSTINC2
#define POSTINC2 POSTINC2
POSTINC2                                 equ 03FDEh
// bitfield definitions
POSTINC2_POSTINC2_POSN                   equ 0000h
POSTINC2_POSTINC2_POSITION               equ 0000h
POSTINC2_POSTINC2_SIZE                   equ 0008h
POSTINC2_POSTINC2_LENGTH                 equ 0008h
POSTINC2_POSTINC2_MASK                   equ 00FFh

// Register: INDF2
#define INDF2 INDF2
INDF2                                    equ 03FDFh
// bitfield definitions
INDF2_INDF2_POSN                         equ 0000h
INDF2_INDF2_POSITION                     equ 0000h
INDF2_INDF2_SIZE                         equ 0008h
INDF2_INDF2_LENGTH                       equ 0008h
INDF2_INDF2_MASK                         equ 00FFh

